-- first query
EXPLAIN ANALYZE SELECT  "Н_ОЦЕНКИ"."КОД", "Н_ВЕДОМОСТИ"."ИД"
FROM    "Н_ОЦЕНКИ"
RIGHT JOIN "Н_ВЕДОМОСТИ"
ON "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
WHERE   "Н_ОЦЕНКИ"."ПРИМЕЧАНИЕ" = 'отлично'
  AND   "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 105590
  AND   "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" < 163249;


-- second query
EXPLAIN ANALYZE SELECT  "Н_ЛЮДИ"."ИМЯ",
        "Н_ОБУЧЕНИЯ"."НЗК",
        "Н_УЧЕНИКИ"."НАЧАЛО"
FROM    "Н_ЛЮДИ"
LEFT JOIN "Н_ОБУЧЕНИЯ"
       ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
LEFT JOIN "Н_УЧЕНИКИ"
       ON "Н_УЧЕНИКИ"."ЧЛВК_ИД"    = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
      AND "Н_УЧЕНИКИ"."ВИД_ОБУЧ_ИД" = "Н_ОБУЧЕНИЯ"."ВИД_ОБУЧ_ИД"
WHERE   "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Георгиевич'
  AND   "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" > 105590;
